tap "heroku/brew"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "spring-io/tap"
brew "autoconf"
brew "automake"
brew "pycparser"
brew "cffi"
brew "cloc"
brew "cmake"
brew "xz"
brew "gcc"
brew "gh"
brew "openssl@3"
brew "readline"
brew "llvm"
brew "python@3.11"
brew "maven"
brew "onnxruntime"
brew "virtualenv"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "tcl-tk"
brew "tree"
brew "wget"
brew "zlib"
brew "heroku/brew/heroku"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "spring-io/tap/spring-boot"
cask "devtoys"
cask "fig"
cask "iterm2"
