tap "heroku/brew"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "spring-io/tap"
brew "astro"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "xz"
brew "azure-cli"
brew "pycparser"
brew "cffi"
brew "cloc"
brew "cmake"
brew "gcc"
brew "gh"
brew "helm"
brew "icu4c@76"
brew "llvm"
brew "maven"
brew "mongosh"
brew "onnxruntime"
brew "pixi"
brew "pnpm"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "rust"
brew "tcl-tk"
brew "tree"
brew "virtualenv"
brew "wget"
brew "xclip"
brew "zlib"
brew "heroku/brew/heroku"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "spring-io/tap/spring-boot"
cask "fig"
cask "iterm2"
cask "openlens"
vscode "anysphere.pyright"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "tomoki1207.pdf"
vscode "twixes.pypi-assistant"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
