charliermarsh.ruff
DavidAnson.vscode-markdownlint
donjayamanne.python-environment-manager
dotenv.dotenv-vscode
eamodio.gitlens
GitHub.copilot
GitHub.copilot-chat
GitHub.vscode-pull-request-github
KevinRose.vsc-python-indent
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
PKief.material-icon-theme
ptweir.python-string-sql
redhat.vscode-yaml
tomoki1207.pdf
usernamehw.errorlens
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
